genestealer/everblu-meters-esp8266-improved/src/main.cpp
  Serial.printf("Data update complete.\n\n");
}

// Deprecated: onScheduled() replaced by millis-based scheduleTick() in state machine
void onScheduled() { /* no-op: preserved for backward compatibility */ }

// Supported abbreviations in MQTT discovery messages for Home Assistant
// Used to reduce the size of the JSON payload
// https://www.home-assistant.io/integrations/mqtt/#supported-abbreviations-in-mqtt-discovery-messages

// Device information - reused in all discovery messages to reduce repetition
// Macro to embed device info in discovery JSON strings
#define DEVICE_JSON \
    "\"ids\": [\"14071984\"],\n" \
    "    \"name\": \"Water Meter\",\n" \
    "    \"mdl\": \"Itron EverBlu Cyble Enhanced Water Meter ESP8266/ESP32\",\n" \
    "    \"mf\": \"Psykokwak [Forked by Genestealer]\""

// JSON Discovery for Reading (Total)
// This is used to show the total water usage in Home Assistant
const char jsonDiscoveryReading[] PROGMEM = R"rawliteral(
{
  "name": "Reading (Total)",
  "uniq_id": "water_meter_value",
  "obj_id": "water_meter_value",
  "ic": "mdi:water",
  "unit_of_meas": "L",
  "dev_cla": "water",
  "stat_cla": "total_increasing",
  "qos": 0,
  "sug_dsp_prc": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/liters",
  "frc_upd": true,
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// Note: Battery percentage sensor removed to comply with HA docs.
// We only expose months remaining (see jsonDiscoveryBatteryMonths) because the
// meter reports months, not percent. Mapping months->% would be arbitrary.

// JSON Discovery for Read Counter
// This is used to show the number of times the meter has been read in Home Assistant
const char jsonDiscoveryReadCounter[] PROGMEM = R"rawliteral(
{
  "name": "Read Counter",
  "uniq_id": "water_meter_counter",
  "obj_id": "water_meter_counter",
  "ic": "mdi:counter",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/counter",
  "frc_upd": true,
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for Last Read (timestamp)
// This is used to show the last time the meter was read in Home Assistant
const char jsonDiscoveryLastRead[] PROGMEM = R"rawliteral(
{
  "name": "Last Read",
  "uniq_id": "water_meter_timestamp",
  "obj_id": "water_meter_timestamp",
  "dev_cla": "timestamp",
  "ic": "mdi:clock",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/timestamp",
  "frc_upd": true,
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for Request Reading (button)
// This is used to trigger a reading from the meter when pressed in Home Assistant
const char jsonDiscoveryRequestReading[] PROGMEM = R"rawliteral(
{
  "name": "Request Reading Now",
  "uniq_id": "water_meter_request",
  "obj_id": "water_meter_request",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "cmd_t": "everblu/cyble/trigger",
  "pl_avail": "online",
  "pl_not_avail": "offline",
  "pl_prs": "update",
  "frc_upd": true,
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for Active Reading (binary sensor)
// This is used to indicate that the device is currently reading data from the meter
const char jsonDiscoveryActiveReading[] PROGMEM = R"rawliteral(
{
  "name": "Active Reading",
  "uniq_id": "water_meter_active_reading",
  "obj_id": "water_meter_active_reading",
  "dev_cla": "running",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/active_reading",
  "pl_on": "true",
  "pl_off": "false",
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for Wi-Fi Details
// These are used to provide information about the Wi-Fi connection of the device
const char jsonDiscoveryWifiIP[] PROGMEM = R"rawliteral(
{
  "name": "IP Address",
  "uniq_id": "water_meter_wifi_ip",
  "obj_id": "water_meter_wifi_ip",
  "ic": "mdi:ip-network-outline",
  "qos": 0,
  "stat_t": "everblu/cyble/wifi_ip",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for Reading Time (HH:MM, UTC)
const char jsonDiscoveryReadingTime[] PROGMEM = R"rawliteral(
{
  "name": "Reading Time (UTC)",
  "uniq_id": "water_meter_reading_time",
  "obj_id": "water_meter_reading_time",
  "ic": "mdi:clock-outline",
  "qos": 0,
  "avty_t": "everblu/cyble/status",
  "stat_t": "everblu/cyble/reading_time",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for Wi-Fi RSSI
// This is used to show the Wi-Fi signal strength in Home Assistant
const char jsonDiscoveryWifiRSSI[] PROGMEM = R"rawliteral(
{
  "name": "WiFi RSSI",
  "uniq_id": "water_meter_wifi_rssi",
  "obj_id": "water_meter_wifi_rssi",
  "dev_cla": "signal_strength",
  "ic": "mdi:signal-variant",
  "unit_of_meas": "dBm",
  "stat_cla": "measurement",
  "qos": 0,
  "stat_t": "everblu/cyble/wifi_rssi",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for Wi-Fi Signal Percentage
// This is used to show the Wi-Fi signal strength as a percentage in Home Assistant
const char jsonDiscoveryWifiSignalPercentage[] PROGMEM = R"rawliteral(
{
  "name": "WiFi Signal",
  "uniq_id": "water_meter_wifi_signal_percentage",
  "obj_id": "water_meter_wifi_signal_percentage",
  "ic": "mdi:wifi",
  "unit_of_meas": "%",
  "stat_cla": "measurement",
  "qos": 0,
  "stat_t": "everblu/cyble/wifi_signal_percentage",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for MAC Address
// This is used to show the MAC address of the device in Home Assistant
const char jsonDiscoveryMacAddress[] PROGMEM = R"rawliteral(
{
  "name": "MAC Address",
  "uniq_id": "water_meter_mac_address",
  "obj_id": "water_meter_mac_address",
  "ic": "mdi:network",
  "qos": 0,
  "stat_t": "everblu/cyble/mac_address",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for BSSID
// This is used to show the BSSID of the device in Home Assistant
const char jsonDiscoveryBSSID[] PROGMEM = R"rawliteral(
{
  "name": "WiFi BSSID",
  "uniq_id": "water_meter_wifi_bssid",
  "obj_id": "water_meter_wifi_bssid",
  "ic": "mdi:access-point-network",
  "qos": 0,
  "stat_t": "everblu/cyble/bssid",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

// JSON Discovery for Wi-Fi SSID
// This is used to show the SSID of the device in Home Assistant
const char jsonDiscoverySSID[] PROGMEM = R"rawliteral(
{
  "name": "WiFi SSID",
  "uniq_id": "water_meter_wifi_ssid",
  "obj_id": "water_meter_wifi_ssid",
  "ic": "mdi:help-network-outline",
  "qos": 0,
  "stat_t": "everblu/cyble/ssid",
  "frc_upd": true,
  "ent_cat": "diagnostic",
  "dev": {
    )rawliteral" DEVICE_JSON R"rawliteral(
  }
}
)rawliteral";

