genestealer/everblu-meters-esp8266-improved/src/main.cpp
  // Scan range: ±30 kHz in 5 kHz steps (±0.03 MHz in 0.005 MHz steps)
  float scanStart = baseFreq - 0.03;
  float scanEnd = baseFreq + 0.03;
  float scanStep = 0.005;
  
  Serial.printf("> Scanning from %.6f to %.6f MHz (step: %.6f MHz)\n", scanStart, scanEnd, scanStep);
  
  for (float freq = scanStart; freq <= scanEnd; freq += scanStep) {
    FEED_WDT(); // Feed watchdog for each frequency step
    // Reinitialize CC1101 with this frequency
    cc1101_init(freq);
    delay(50); // Allow time for frequency to settle
    
    // Try to get meter data (with short timeout)
    struct tmeter_data test_data = get_meter_data();
    
    if (test_data.rssi_dbm > bestRSSI && test_data.reads_counter > 0) {
      bestRSSI = test_data.rssi_dbm;
      bestFreq = freq;
      Serial.printf("> Better signal at %.6f MHz: RSSI=%d dBm\n", freq, test_data.rssi_dbm);
    }
  }
  
  // Calculate and save the offset
  float offset = bestFreq - baseFreq;
  Serial.printf("> Frequency scan complete. Best frequency: %.6f MHz (offset: %.6f MHz, RSSI: %d dBm)\n", 
                bestFreq, offset, bestRSSI);
  
  if (bestRSSI > -120) { // Only save if we found something
    saveFrequencyOffset(offset);
    
    char freqBuffer[16];
    snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", offset * 1000.0);  // Convert MHz to kHz
    mqtt.publish("everblu/cyble/frequency_offset", freqBuffer, true);
    
    char statusMsg[128];
    snprintf(statusMsg, sizeof(statusMsg), "Scan complete: offset %.3f kHz, RSSI %d dBm", offset * 1000.0, bestRSSI);
    mqtt.publish("everblu/cyble/status_message", statusMsg, true);
    
    // Reinitialize with the best frequency
    cc1101_init(bestFreq);
  } else {
    Serial.println("> Frequency scan failed - no valid signal found");
    mqtt.publish("everblu/cyble/status_message", "Frequency scan failed - no signal", true);
    // Restore original frequency
    cc1101_init(baseFreq + storedFrequencyOffset);
  }
  
  mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
}

// Function: performWideInitialScan
// Description: Performs a wide-band scan on first boot to find meter frequency automatically
//              Scans ±100 kHz around the configured frequency in larger steps for faster discovery
void performWideInitialScan() {
  Serial.println("> Performing wide initial scan (first boot - no saved offset)...");
  mqtt.publish("everblu/cyble/cc1101_state", "Initial Frequency Scan", true);
  mqtt.publish("everblu/cyble/status_message", "First boot: scanning for meter frequency", true);
  
  float baseFreq = FREQUENCY;
  float bestFreq = baseFreq;
  int bestRSSI = -120;
  
  // Wide scan: ±100 kHz in 10 kHz steps for faster initial discovery
  float scanStart = baseFreq - 0.10;
  float scanEnd = baseFreq + 0.10;
  float scanStep = 0.010;
  
  Serial.printf("> Wide scan from %.6f to %.6f MHz (step: %.6f MHz)\n", scanStart, scanEnd, scanStep);
  Serial.println("> This may take 1-2 minutes on first boot...");
  
  for (float freq = scanStart; freq <= scanEnd; freq += scanStep) {
    FEED_WDT(); // Feed watchdog for each frequency step
    cc1101_init(freq);
    delay(100); // Longer delay for frequency to settle during wide scan
    
    struct tmeter_data test_data = get_meter_data();
    
    if (test_data.rssi_dbm > bestRSSI && test_data.reads_counter > 0) {
      bestRSSI = test_data.rssi_dbm;
      bestFreq = freq;
      Serial.printf("> Found signal at %.6f MHz: RSSI=%d dBm\n", freq, test_data.rssi_dbm);
    }
  }
  
  if (bestRSSI > -120) {
    // Found a signal, now do a fine scan around it
    Serial.printf("> Performing fine scan around %.6f MHz...\n", bestFreq);
    float fineStart = bestFreq - 0.015;
    float fineEnd = bestFreq + 0.015;
    float fineStep = 0.003;
    int fineBestRSSI = bestRSSI;
    float fineBestFreq = bestFreq;
    
    for (float freq = fineStart; freq <= fineEnd; freq += fineStep) {
      FEED_WDT(); // Feed watchdog for each frequency step
      cc1101_init(freq);
      delay(50);
      
      struct tmeter_data test_data = get_meter_data();
      
      if (test_data.rssi_dbm > fineBestRSSI && test_data.reads_counter > 0) {
        fineBestRSSI = test_data.rssi_dbm;
        fineBestFreq = freq;
        Serial.printf("> Refined signal at %.6f MHz: RSSI=%d dBm\n", freq, test_data.rssi_dbm);
      }
    }
    
    bestFreq = fineBestFreq;
    bestRSSI = fineBestRSSI;
    
    float offset = bestFreq - baseFreq;
    Serial.printf("> Initial scan complete! Best frequency: %.6f MHz (offset: %.6f MHz, RSSI: %d dBm)\n", 
                  bestFreq, offset, bestRSSI);
    
    saveFrequencyOffset(offset);
    
    char freqBuffer[16];
    snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", offset * 1000.0);  // Convert MHz to kHz
    mqtt.publish("everblu/cyble/frequency_offset", freqBuffer, true);
    
    char statusMsg[128];
    snprintf(statusMsg, sizeof(statusMsg), "Initial scan complete: offset %.3f kHz", offset * 1000.0);
    mqtt.publish("everblu/cyble/status_message", statusMsg, true);
    
    cc1101_init(bestFreq);
  } else {
    Serial.println("> Wide scan failed - no meter signal found!");
    Serial.println("> Please check:");
    Serial.println(">  1. Meter is within range (< 50m typically)");
    Serial.println(">  2. Antenna is connected to CC1101");
    Serial.println(">  3. Meter serial/year are correct in config.h");
    Serial.println(">  4. Current time is within meter's wake hours");
    mqtt.publish("everblu/cyble/status_message", "Initial scan failed - check setup", true);
    cc1101_init(baseFreq);
  }
  
  mqtt.publish("everblu/cyble/cc1101_state", "Idle", true);
}

// Function: adaptiveFrequencyTracking
// Description: Uses FREQEST register to adaptively adjust frequency offset over time
//              Accumulates frequency error estimates and adjusts when threshold is reached
void adaptiveFrequencyTracking(int8_t freqest) {
  // FREQEST is a two's complement value representing frequency offset
  // Resolution is approximately Fxosc/2^14 ≈ 1.59 kHz per LSB (for 26 MHz crystal)
  const float FREQEST_TO_MHZ = 0.001587; // Conversion factor: ~1.59 kHz per LSB
  
  // Accumulate the frequency error
  float freqErrorMHz = (float)freqest * FREQEST_TO_MHZ;
  cumulativeFreqError += freqErrorMHz;
  successfulReadsBeforeAdapt++;
  
  Serial.printf("> FREQEST: %d (%.4f kHz error), cumulative: %.4f kHz over %d reads\n", 
                freqest, freqErrorMHz * 1000, cumulativeFreqError * 1000, successfulReadsBeforeAdapt);
  
  // Only adapt after N successful reads to avoid over-correcting on noise
  if (successfulReadsBeforeAdapt >= ADAPT_THRESHOLD) {
    float avgError = cumulativeFreqError / ADAPT_THRESHOLD;
    
    // Only adjust if average error is significant (> 2 kHz)
    if (abs(avgError * 1000) > 2.0) {
      Serial.printf("> Adaptive adjustment: average error %.4f kHz over %d reads\n", 
                    avgError * 1000, ADAPT_THRESHOLD);
      
      // Adjust the stored offset (apply 50% of the measured error to avoid over-correction)
      float adjustment = avgError * 0.5;
      storedFrequencyOffset += adjustment;
      
      Serial.printf("> Adjusting frequency offset by %.6f MHz (new offset: %.6f MHz)\n", 
                    adjustment, storedFrequencyOffset);
      
      saveFrequencyOffset(storedFrequencyOffset);
      
      char freqBuffer[16];
      snprintf(freqBuffer, sizeof(freqBuffer), "%.3f", storedFrequencyOffset * 1000.0);  // Convert MHz to kHz
      mqtt.publish("everblu/cyble/frequency_offset", freqBuffer, true);
      
      // Reinitialize CC1101 with adjusted frequency
      cc1101_init(FREQUENCY + storedFrequencyOffset);
    } else {
      Serial.printf("> Frequency stable (avg error %.4f kHz < 2 kHz threshold)\n", avgError * 1000);
    }
    
    // Reset accumulators
    cumulativeFreqError = 0.0;
    successfulReadsBeforeAdapt = 0;
  }
}


