genestealer/everblu-meters-esp8266-improved/src/main.cpp
// Function: validateConfiguration
// Description: Validates configuration parameters at startup to fail fast on invalid settings
bool validateConfiguration() {
  bool valid = true;
  
  Serial.println("\n=== Configuration Validation ===");
  
  // Validate METER_YEAR (should be 0-99 for years 2000-2099)
  if (METER_YEAR > 99) {
    Serial.printf("ERROR: Invalid METER_YEAR=%d (expected 0-99)\n", METER_YEAR);
    valid = false;
  } else {
    Serial.printf("✓ METER_YEAR: %d (20%02d)\n", METER_YEAR, METER_YEAR);
  }
  
  // Validate METER_SERIAL (should not be 0)
  if (METER_SERIAL == 0) {
    Serial.println("ERROR: METER_SERIAL not configured (value is 0)");
    Serial.println("       Update METER_SERIAL in config.h with your meter's serial number");
    valid = false;
  } else {
    Serial.printf("✓ METER_SERIAL: %lu\n", (unsigned long)METER_SERIAL);
  }
  
  // Validate FREQUENCY if defined (should be 300-500 MHz for 433 MHz band)
  #ifdef FREQUENCY
  if (FREQUENCY < 300.0 || FREQUENCY > 500.0) {
    Serial.printf("ERROR: Invalid FREQUENCY=%.2f MHz (expected 300-500 MHz)\n", FREQUENCY);
    valid = false;
  } else {
    Serial.printf("✓ FREQUENCY: %.6f MHz\n", FREQUENCY);
  }
  #else
  Serial.println("✓ FREQUENCY: Using default 433.82 MHz (RADIAN protocol)");
  #endif
  
  // Validate GDO0 pin (basic check - should be defined)
  #ifdef GDO0
  Serial.printf("✓ GDO0 Pin: GPIO %d\n", GDO0);
  #else
  Serial.println("ERROR: GDO0 pin not defined in config.h");
  valid = false;
  #endif
  
  // Validate reading schedule
  if (!isValidReadingSchedule(readingSchedule)) {
    Serial.printf("ERROR: Invalid reading schedule '%s'\n", readingSchedule);
    Serial.println("       Expected: 'Monday-Friday', 'Monday-Saturday', or 'Monday-Sunday'");
    valid = false;
  } else {
    Serial.printf("✓ Reading Schedule: %s\n", readingSchedule);
  }
  
  Serial.println("================================\n");
  
  return valid;
}

// Function: setup
// Description: Initializes the device, including serial communication, Wi-Fi, MQTT, and CC1101 radio with automatic calibration.
void setup()
{
  Serial.begin(115200);
  Serial.println("\n");
  Serial.println("Everblu Meters ESP8266/ESP32 Starting...");
  Serial.println("Water usage data for Home Assistant");
  Serial.println("https://github.com/genestealer/everblu-meters-esp8266-improved");
  Serial.printf("Target meter: 20%02d-%07lu\n\n", METER_YEAR, (unsigned long)METER_SERIAL);

  // Validate configuration before proceeding
  if (!validateConfiguration()) {
    Serial.println("\n*** FATAL: Configuration validation failed! ***");
    Serial.println("*** Fix the errors in config.h and reflash ***");
    Serial.println("*** Device halted - will not continue ***\n");
    while(1) {
      digitalWrite(LED_BUILTIN, LOW);  // Blink LED to indicate error
      delay(200);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(200);
    }
  }
  
  Serial.println("✓ Configuration valid - proceeding with initialization\n");

  pinMode(LED_BUILTIN, OUTPUT);
  digitalWrite(LED_BUILTIN, LOW); // turned on to start with

  // Initialize persistent storage
#if defined(ESP8266)
  EEPROM.begin(EEPROM_SIZE);
  Serial.println("> EEPROM initialized");
  
  // Clear EEPROM if requested (set CLEAR_EEPROM_ON_BOOT=1 in config.h)
  // Use this when replacing ESP board, CC1101 module, or moving to a different meter
  #if CLEAR_EEPROM_ON_BOOT
    Serial.println("> CLEARING EEPROM (CLEAR_EEPROM_ON_BOOT = 1)...");
    for (int i = 0; i < EEPROM_SIZE; i++) {
      EEPROM.write(i, 0xFF);
    }
    EEPROM.commit();
    Serial.println("> EEPROM cleared. Remember to set CLEAR_EEPROM_ON_BOOT = 0 after testing!");
  #endif
#endif

  // Load stored frequency offset
  storedFrequencyOffset = loadFrequencyOffset();

  // If no valid frequency offset found and auto-scan is enabled, perform wide initial scan
  if (storedFrequencyOffset == 0.0 && autoScanEnabled) {
    Serial.println("> No stored frequency offset found. Performing wide initial scan...");
    performWideInitialScan();
    // Reload the frequency offset after scan
    storedFrequencyOffset = loadFrequencyOffset();
  }

  // Increase the max packet size to handle large MQTT payloads
  mqtt.setMaxPacketSize(2048); // Set to a size larger than your longest payload

  // Set the Last Will and Testament (LWT)
  mqtt.enableLastWillMessage("everblu/cyble/status", "offline", true);  // You can activate the retain flag by setting the third parameter to true

  // Conditionally enable Wi-Fi PHY mode 11G (ESP8266 only).
  #if defined(ESP8266)
    #if ENABLE_WIFI_PHY_MODE_11G
    WiFi.setPhyMode(WIFI_PHY_MODE_11G);
    Serial.println("Wi-Fi PHY mode set to 11G.");
    #else
    Serial.println("> Wi-Fi PHY mode 11G is disabled.");
    #endif
  #else
    Serial.println("> Wi-Fi PHY mode setting not applicable on this platform.");
  #endif

  // Validate and log the configured reading schedule
  Serial.printf("> Reading schedule (configured): %s\n", readingSchedule);
  validateReadingSchedule();
  Serial.printf("> Reading schedule (effective): %s\n", readingSchedule);

  // Log effective frequency and warn if default is used
  Serial.printf("> Frequency (effective): %.6f MHz\n", (double)FREQUENCY);
#if FREQUENCY_DEFINED_DEFAULT
  Serial.println("WARNING: FREQUENCY not set in config.h; using default 433.820000 MHz (RADIAN).");
#endif

  // Optional functionalities of EspMQTTClient
  // mqtt.enableDebuggingMessages(true); // Enable debugging messages sent to serial output

  // Set CC1101 radio frequency with automatic calibration
  Serial.println("> Initializing CC1101 radio...");
  float effectiveFrequency = FREQUENCY + storedFrequencyOffset;
  if (storedFrequencyOffset != 0.0) {
    Serial.printf("> Applying stored frequency offset: %.6f MHz (effective: %.6f MHz)\n", 
                  storedFrequencyOffset, effectiveFrequency);
  }
  if (!cc1101_init(effectiveFrequency)) {
    Serial.println("FATAL ERROR: CC1101 radio initialization failed!");
    Serial.println("Please check your wiring and connections.");
    while (true) {
      digitalWrite(LED_BUILTIN, LOW);  // Blink LED to indicate error
      delay(200);
      digitalWrite(LED_BUILTIN, HIGH);
      delay(200);
    }
  }
  Serial.println("> CC1101 radio initialized successfully");

