genestealer/everblu-meters-esp8266-improved/src/main.cpp
  /*
  // Use this piece of code to test
  struct tmeter_data meter_data;
  meter_data = get_meter_data();
  Serial.printf("\nLiters : %d\nBattery (in months) : %d\nCounter : %d\nTime start : %d\nTime end : %d\n\n", meter_data.liters, meter_data.battery_left, meter_data.reads_counter, meter_data.time_start, meter_data.time_end);
  while (42);
  */

}

// ----------------------
// Lightweight App State Machine (implementations)
// ----------------------

static void requestRead() {
  if (appState == APP_READING) return; // already reading
  appState = APP_READ_REQUESTED;
}

// Check once every ~500ms whether it's time to read (UTC window + cooldown)
static void scheduleTick() {
  static unsigned long lastCheck = 0;
  if (millis() - lastCheck < 500) return;
  lastCheck = millis();

  time_t tnow = time(nullptr);
  struct tm *ptm = gmtime(&tnow);

  if (isReadingDay(ptm) && ptm->tm_hour == g_readHourUtc && ptm->tm_min == g_readMinuteUtc && ptm->tm_sec == 0) {
    // Respect cooldown after a failed attempt
    if (lastFailedAttempt > 0 && (millis() - lastFailedAttempt) < RETRY_COOLDOWN) {
      unsigned long remainingCooldown = (RETRY_COOLDOWN - (millis() - lastFailedAttempt)) / 1000;
      Serial.printf("Still in cooldown period. %lu seconds remaining.\n", remainingCooldown);
      char cooldownMsg[64];
      snprintf(cooldownMsg, sizeof(cooldownMsg), "Cooldown active, %lus remaining", remainingCooldown);
      mqtt.publish("everblu/cyble/status_message", cooldownMsg, true);
      return;
    }

    lastFailedAttempt = 0; // Cooldown over
    Serial.println("It is time to update data from meter :) ");
    _retry = 0;
    requestRead();
  }
}

static void stateMachineTick() {
  // Periodic schedule checker when in idle/waiting state
  if (appState == APP_IDLE || appState == APP_WAIT_SCHEDULE) {
    scheduleTick();
  }

  switch (appState) {
    case APP_READ_REQUESTED: {
      // Start a read (synchronous call, but orchestrated here)
      appState = APP_READING;
      onUpdateData();
      // onUpdateData() handles retries and publishing; when it returns, go idle/wait
      appState = APP_WAIT_SCHEDULE;
      break;
    }
    case APP_RETRY_WAIT: {
      if (millis() >= appNextActionAt) {
        appState = APP_READ_REQUESTED;
      }
      break;
    }
    default:
      break;
  }
}

// Function: loop
// Description: Main loop to handle MQTT/OTA, state machine, and periodic diagnostics.
void loop() {
  mqtt.loop();
  ArduinoOTA.handle();

  // Drive non-blocking app state machine
  stateMachineTick();

  // Update diagnostics and Wi-Fi details every 5 minutes
  if (millis() - lastWifiUpdate > 300000) { // 5 minutes in ms
    publishWifiDetails();
    lastWifiUpdate = millis();
  }
}

